# 使用的编译器
CC=g++
# # 预处理参数
# 选项
CFLAGS=-Wall
# 需要链接的动态库
LIBS=-lmysqlclient  
Libs_Path=-L /usr/local/lib64/mysql
# 子目标, 因为是测试,所有需要单独生成很多子目标
# 测试用
app=app
# 最终目标
target=$(app)
ALL:$(target)

#######################################################################
#                        测试程序相关的规则
# 生成每一个子目标,
# main程序
$(app): main.o MysqlApi.o
	$(CC) -o$@ $^ $(LIBS) $(Libs_Path) 

	#######################################################################
#######################################################################
#                         所有程序都需要的规则
# 生成所有的.o 文件
%.o:%.c
	$(CC) -c $< -o $@  $(CFLAGS)

# 项目清除
clean:
	-rm -rf *.o $(target) 

# 声明伪文件
.PHONY:clean ALL
	#######################################################################
